; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v4 ?v10)
             (pred_10 ?v6 ?v8)
             (pred_1 ?v4 ?v8)
             (pred_4 ?v5 ?v4 )
	     (pred_7 ?v4)
             (pred_5 ?v13)
             (pred_2 ?v6)
             (pred_11 ?v8)
             (pred_12 ?v4)
             (pred_8 ?v6)
             (pred_9 ?v4)
             (pred_3 ))



(:action op_4
:parameters (?v7 ?v1 ?v9 ?v2)
:precondition (and (pred_5 ?v7) (pred_5 ?v1) (pred_2 ?v9) (pred_11 ?v2)
          (pred_6 ?v7 ?v1) (pred_10 ?v9 ?v2)
                   (pred_1 ?v1 ?v2) (pred_7 ?v7) 
                   (pred_12 ?v1) (pred_8 ?v9))
:effect (and  (pred_9 ?v1) (not (pred_12 ?v1))))


(:action op_2
:parameters (?v7 ?v12)
:precondition (and (pred_5 ?v7) (pred_5 ?v12)
               (pred_7 ?v7) (pred_6 ?v7 ?v12) (pred_9 ?v12))
:effect (and (pred_7 ?v12) (not (pred_7 ?v7))))

(:action op_1
:parameters (?v7 ?v9)
:precondition (and (pred_5 ?v7) (pred_2 ?v9) 
                  (pred_7 ?v7) (pred_4 ?v9 ?v7) (pred_3 ))
:effect (and (pred_8 ?v9)
   (not (pred_4 ?v9 ?v7)) (not (pred_3 ))))


(:action op_3
:parameters (?v7 ?v3 ?v11)
:precondition (and (pred_5 ?v7) (pred_2 ?v3) (pred_2 ?v11)
                  (pred_7 ?v7) (pred_8 ?v11) (pred_4 ?v3 ?v7))
:effect (and (pred_8 ?v3) (pred_4 ?v11 ?v7)
        (not (pred_8 ?v11)) (not (pred_4 ?v3 ?v7))))

(:action op_5
:parameters (?v7 ?v9)
:precondition (and (pred_5 ?v7) (pred_2 ?v9) 
                  (pred_7 ?v7) (pred_8 ?v9))
:effect (and (pred_3 ) (pred_4 ?v9 ?v7) (not (pred_8 ?v9)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_30 obj_22 obj_19 obj_24 obj_27 obj_04 obj_25 obj_29 obj_09 obj_12 obj_10 obj_28 obj_20 obj_21 obj_26 obj_07 obj_11 obj_16 obj_03 obj_23 obj_17 obj_14 obj_18 obj_06 obj_01
    obj_31 obj_02 obj_13
    obj_15 obj_05 obj_08 obj_32
    )

    (:init
       (pred_3)

       (pred_5 obj_30)
       (pred_5 obj_22)
       (pred_5 obj_19)
       (pred_5 obj_24)
       (pred_5 obj_27)
       (pred_5 obj_04)
       (pred_5 obj_25)
       (pred_5 obj_29)
       (pred_5 obj_09)
       (pred_5 obj_12)
       (pred_5 obj_10)
       (pred_5 obj_28)
       (pred_5 obj_20)
       (pred_5 obj_21)
       (pred_5 obj_26)
       (pred_5 obj_07)
       (pred_5 obj_11)
       (pred_5 obj_16)
       (pred_5 obj_03)
       (pred_5 obj_23)
       (pred_5 obj_17)
       (pred_5 obj_14)
       (pred_5 obj_18)
       (pred_5 obj_06)
       (pred_5 obj_01)
       (pred_11 obj_31)
       (pred_11 obj_02)
       (pred_11 obj_13)
       (pred_2 obj_15)
       (pred_2 obj_05)
       (pred_2 obj_08)
       (pred_2 obj_32)

       (pred_6 obj_30 obj_04)
       (pred_6 obj_30 obj_22)
       (pred_6 obj_22 obj_25)
       (pred_6 obj_22 obj_19)
       (pred_6 obj_22 obj_30)
       (pred_6 obj_19 obj_29)
       (pred_6 obj_19 obj_24)
       (pred_6 obj_19 obj_22)
       (pred_6 obj_24 obj_09)
       (pred_6 obj_24 obj_27)
       (pred_6 obj_24 obj_19)
       (pred_6 obj_27 obj_12)
       (pred_6 obj_27 obj_24)
       (pred_6 obj_04 obj_10)
       (pred_6 obj_04 obj_25)
       (pred_6 obj_04 obj_30)
       (pred_6 obj_25 obj_28)
       (pred_6 obj_25 obj_29)
       (pred_6 obj_25 obj_22)
       (pred_6 obj_25 obj_04)
       (pred_6 obj_29 obj_20)
       (pred_6 obj_29 obj_09)
       (pred_6 obj_29 obj_19)
       (pred_6 obj_29 obj_25)
       (pred_6 obj_09 obj_21)
       (pred_6 obj_09 obj_12)
       (pred_6 obj_09 obj_24)
       (pred_6 obj_09 obj_29)
       (pred_6 obj_12 obj_26)
       (pred_6 obj_12 obj_27)
       (pred_6 obj_12 obj_09)
       (pred_6 obj_10 obj_07)
       (pred_6 obj_10 obj_28)
       (pred_6 obj_10 obj_04)
       (pred_6 obj_28 obj_11)
       (pred_6 obj_28 obj_20)
       (pred_6 obj_28 obj_25)
       (pred_6 obj_28 obj_10)
       (pred_6 obj_20 obj_16)
       (pred_6 obj_20 obj_21)
       (pred_6 obj_20 obj_29)
       (pred_6 obj_20 obj_28)
       (pred_6 obj_21 obj_03)
       (pred_6 obj_21 obj_26)
       (pred_6 obj_21 obj_09)
       (pred_6 obj_21 obj_20)
       (pred_6 obj_26 obj_23)
       (pred_6 obj_26 obj_12)
       (pred_6 obj_26 obj_21)
       (pred_6 obj_07 obj_17)
       (pred_6 obj_07 obj_11)
       (pred_6 obj_07 obj_10)
       (pred_6 obj_11 obj_14)
       (pred_6 obj_11 obj_16)
       (pred_6 obj_11 obj_28)
       (pred_6 obj_11 obj_07)
       (pred_6 obj_16 obj_18)
       (pred_6 obj_16 obj_03)
       (pred_6 obj_16 obj_20)
       (pred_6 obj_16 obj_11)
       (pred_6 obj_03 obj_06)
       (pred_6 obj_03 obj_23)
       (pred_6 obj_03 obj_21)
       (pred_6 obj_03 obj_16)
       (pred_6 obj_23 obj_01)
       (pred_6 obj_23 obj_26)
       (pred_6 obj_23 obj_03)
       (pred_6 obj_17 obj_14)
       (pred_6 obj_17 obj_07)
       (pred_6 obj_14 obj_18)
       (pred_6 obj_14 obj_11)
       (pred_6 obj_14 obj_17)
       (pred_6 obj_18 obj_06)
       (pred_6 obj_18 obj_16)
       (pred_6 obj_18 obj_14)
       (pred_6 obj_06 obj_01)
       (pred_6 obj_06 obj_03)
       (pred_6 obj_06 obj_18)
       (pred_6 obj_01 obj_23)
       (pred_6 obj_01 obj_06)
       (pred_12 obj_21)
       (pred_12 obj_28)
       (pred_12 obj_19)
       (pred_12 obj_26)
       (pred_1  obj_21 obj_31)
       (pred_1  obj_28 obj_02)
       (pred_1  obj_19 obj_13)
       (pred_1  obj_26 obj_02)
       (pred_9 obj_30)
       (pred_9 obj_22)
       (pred_9 obj_24)
       (pred_9 obj_27)
       (pred_9 obj_04)
       (pred_9 obj_25)
       (pred_9 obj_29)
       (pred_9 obj_09)
       (pred_9 obj_12)
       (pred_9 obj_10)
       (pred_9 obj_20)
       (pred_9 obj_07)
       (pred_9 obj_11)
       (pred_9 obj_16)
       (pred_9 obj_03)
       (pred_9 obj_23)
       (pred_9 obj_17)
       (pred_9 obj_14)
       (pred_9 obj_18)
       (pred_9 obj_06)
       (pred_9 obj_01)

       (pred_10  obj_15 obj_31)
       (pred_10  obj_05 obj_02)
       (pred_10  obj_08 obj_13)
       (pred_10  obj_32 obj_02)
       (pred_4 obj_15 obj_10)
       (pred_4 obj_05 obj_26)
       (pred_4 obj_08 obj_20)
       (pred_4 obj_32 obj_18)
       (pred_7 obj_09)
    )

    (:goal (and
       (pred_4 obj_15 obj_24)
       (pred_4 obj_08 obj_06)
       (pred_4 obj_32 obj_04)
    ))
(:constraints
  (always (not (pred_7 obj_16)))
)
)

; plan
1. (op_2 obj_09 obj_29)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_29)
   goals met: 0 of 3
2. (op_2 obj_29 obj_20)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_20)
   goals met: 0 of 3
3. (op_1 obj_20 obj_08)
   deleted: (pred_4 obj_08 obj_20) (pred_3)
   added: (pred_8 obj_08)
   goals met: 0 of 3
4. (op_2 obj_20 obj_29)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_29)
   goals met: 0 of 3
5. (op_2 obj_29 obj_25)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_25)
   goals met: 0 of 3
6. (op_2 obj_25 obj_04)
   deleted: (pred_7 obj_25)
   added: (pred_7 obj_04)
   goals met: 0 of 3
7. (op_2 obj_04 obj_10)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_10)
   goals met: 0 of 3
8. (op_3 obj_10 obj_15 obj_08)
   deleted: (pred_8 obj_08) (pred_4 obj_15 obj_10)
   added: (pred_8 obj_15) (pred_4 obj_08 obj_10)
   goals met: 0 of 3
9. (op_2 obj_10 obj_04)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_04)
   goals met: 0 of 3
10. (op_5 obj_04 obj_15)
   deleted: (pred_8 obj_15)
   added: (pred_3) (pred_4 obj_15 obj_04)
   goals met: 0 of 3
11. (op_2 obj_04 obj_10)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_10)
   goals met: 0 of 3
12. (op_1 obj_10 obj_08)
   deleted: (pred_4 obj_08 obj_10) (pred_3)
   added: (pred_8 obj_08)
   goals met: 0 of 3
13. (op_2 obj_10 obj_04)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_04)
   goals met: 0 of 3
14. (op_3 obj_04 obj_15 obj_08)
   deleted: (pred_8 obj_08) (pred_4 obj_15 obj_04)
   added: (pred_8 obj_15) (pred_4 obj_08 obj_04)
   goals met: 0 of 3
15. (op_2 obj_04 obj_25)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_25)
   goals met: 0 of 3
16. (op_2 obj_25 obj_29)
   deleted: (pred_7 obj_25)
   added: (pred_7 obj_29)
   goals met: 0 of 3
17. (op_2 obj_29 obj_09)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_09)
   goals met: 0 of 3
18. (op_4 obj_09 obj_21 obj_15 obj_31)
   deleted: (pred_12 obj_21)
   added: (pred_9 obj_21)
   goals met: 0 of 3
19. (op_2 obj_09 obj_21)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_21)
   goals met: 0 of 3
20. (op_2 obj_21 obj_03)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_03)
   goals met: 0 of 3
21. (op_2 obj_03 obj_06)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_06)
   goals met: 0 of 3
22. (op_5 obj_06 obj_15)
   deleted: (pred_8 obj_15)
   added: (pred_3) (pred_4 obj_15 obj_06)
   goals met: 0 of 3
23. (op_2 obj_06 obj_18)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_18)
   goals met: 0 of 3
24. (op_1 obj_18 obj_32)
   deleted: (pred_4 obj_32 obj_18) (pred_3)
   added: (pred_8 obj_32)
   goals met: 0 of 3
25. (op_2 obj_18 obj_06)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_06)
   goals met: 0 of 3
26. (op_2 obj_06 obj_03)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_03)
   goals met: 0 of 3
27. (op_2 obj_03 obj_21)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_21)
   goals met: 0 of 3
28. (op_2 obj_21 obj_09)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_09)
   goals met: 0 of 3
29. (op_2 obj_09 obj_29)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_29)
   goals met: 0 of 3
30. (op_2 obj_29 obj_25)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_25)
   goals met: 0 of 3
31. (op_2 obj_25 obj_04)
   deleted: (pred_7 obj_25)
   added: (pred_7 obj_04)
   goals met: 0 of 3
32. (op_3 obj_04 obj_08 obj_32)
   deleted: (pred_8 obj_32) (pred_4 obj_08 obj_04)
   added: (pred_8 obj_08) (pred_4 obj_32 obj_04)
   goals met: 1 of 3
33. (op_2 obj_04 obj_25)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_25)
   goals met: 1 of 3
34. (op_2 obj_25 obj_29)
   deleted: (pred_7 obj_25)
   added: (pred_7 obj_29)
   goals met: 1 of 3
35. (op_2 obj_29 obj_09)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_09)
   goals met: 1 of 3
36. (op_2 obj_09 obj_24)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_24)
   goals met: 1 of 3
37. (op_5 obj_24 obj_08)
   deleted: (pred_8 obj_08)
   added: (pred_3) (pred_4 obj_08 obj_24)
   goals met: 1 of 3
38. (op_2 obj_24 obj_09)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_09)
   goals met: 1 of 3
39. (op_2 obj_09 obj_21)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_21)
   goals met: 1 of 3
40. (op_2 obj_21 obj_03)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_03)
   goals met: 1 of 3
41. (op_2 obj_03 obj_06)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_06)
   goals met: 1 of 3
42. (op_1 obj_06 obj_15)
   deleted: (pred_4 obj_15 obj_06) (pred_3)
   added: (pred_8 obj_15)
   goals met: 1 of 3
43. (op_2 obj_06 obj_03)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_03)
   goals met: 1 of 3
44. (op_2 obj_03 obj_21)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_21)
   goals met: 1 of 3
45. (op_2 obj_21 obj_09)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_09)
   goals met: 1 of 3
46. (op_2 obj_09 obj_24)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_24)
   goals met: 1 of 3
47. (op_3 obj_24 obj_08 obj_15)
   deleted: (pred_8 obj_15) (pred_4 obj_08 obj_24)
   added: (pred_8 obj_08) (pred_4 obj_15 obj_24)
   goals met: 2 of 3
48. (op_2 obj_24 obj_09)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_09)
   goals met: 2 of 3
49. (op_2 obj_09 obj_21)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_21)
   goals met: 2 of 3
50. (op_2 obj_21 obj_03)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_03)
   goals met: 2 of 3
51. (op_2 obj_03 obj_06)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_06)
   goals met: 2 of 3
52. (op_5 obj_06 obj_08)
   deleted: (pred_8 obj_08)
   added: (pred_3) (pred_4 obj_08 obj_06)
   goals met: 3 of 3
